In [29]:
1.
import pandas as pd
li=[4,8,15,16,22,42]
df=pd.Series(li)
df

0     4
1     8
2    15
3    16
4    22
5    42
dtype: int64

In [30]:
2.
li=[4,8,1,16,22,42]
pd.Series(li)

0     4
1     8
2     1
3    16
4    22
5    42
dtype: int64

In [13]:
ser.sort_values()

2     1
0     4
1     8
3    16
4    22
5    42
Name: 0, dtype: int64

In [28]:
3.
data={"name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
pd.DataFrame(data)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
4.
Data frame is multidimensional structer collection of data 
Pandas.series is one dimanal series od fata with its index
series is one dimensinal but pandas can be one or multidimensional

In [25]:
5.
data={"name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
df=pd.DataFrame(data)
df.head()#which show first 5 data 
df.tail()#which show last 5 data 
print(df[['name','Age']])

     name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [ ]:
6.
DataFrame is mutable in nature

In [36]:
7.
df1=pd.Series([4,8,15,16,22,42])# we create a Series.
df2=pd.Series([4,8,15,16,2,42])# we create a Series.
pd.DataFrame([df1,df2])# we create a Series.

   0  1   2   3   4   5
0  4  8  15  16  22  42
1  4  8  15  16   2  42